{
  "technologies": "Tecnologías",
  "projects": "Proyectos",
  "testimonials": "Testimonios",
  "aboutMeTitle": "Sobre mí",
  "aboutMe": "Soy una persona apasionada por la programación y en constante crecimiento personal y profesional, cuyo objetivo principal es construir una carrera en el mundo IT aprendiendo de mis compañeros con más trayectoria y transmitiendo mi conocimiento a los menos experimentados.",
  "downloadCV": "Descargar CV",
  "contactMe": "Contáctame",
  "wineSupplyDescription": "Creamos una aplicación ecommerce responsiva de vinos (con enfoque mobile-first). Mi rol principal fue desarrollador front-end con typescript, react, redux, html y css. Fui responsable de hacer toda la página principal, la funcionalidad de filtro, una página de pago con la dirección del usuario (API de Google Maps), la funcionalidad de inicio de sesión, entre otras cosas.",
  "dogAppDescription": "La página consiste en una aplicación full stack de una sola página (SAP) que utiliza la API de perros. Para el backend utilicé express, para crear endpoints para consumir y publicar información que se almacena en una base de datos de PostgreSQL usando Sequelize. Para el frontend usé HTML5, CSS3, React.js y Redux para gestionar mis solicitudes al backend.",
  "marvelAppDescription": "Utilicé la API de marvel para practicar fetching de datos y su posterior manejo para manipular el estado de la aplicación, a nivel componente (useState) y a nivel global (Redux). En la página se pueden ver personajes que se relacionan con sus comics mediante un click, al igual que se pueden agregar a favoritos y filtrar mediante la barra de búsqueda.",
  "copyRightNotice": "Propiedad intelectual de Efraín Chacón Galindo",
  "contactInformation": "Información de contacto",
  "certificates": "Certificados",
  "social": "Redes sociales",
  "previewMyCV": "Vista de mi CV",
  "previewMyCoverLetter": "Vista de mi carta de presentación",
  "needSomeone": "Necesitas a alguien con éstas habilidades?",
  "seeMyProjects": "Podrías tener éste talento en tu equipo",
  "colleaguesOpinion": "Lo que mis compañeros opinan de mí",
  "eugeTestimonial": "He trabajado con Efraín en un proyecto grupal de 8 integrantes, que fue el proyecto final para graduarnos como Full Stack Web Developer del Bootcamp de Henry. Ha sido un placer compartir con él, muy amigable, con buena energía para empezar todos los días, gran compañero siempre dispuesto para ayudar y resolver problemas. Ha hecho grandes contribuciones al proyecto desde el front end, para las cuales tuvo que aprender nuevas tecnologías, las cuales implementó exitosamente. También sumó muchas ideas, bien pensadas para la interfaz de usuario, con muy buen estilo. Destaco su compañerismo, buena comunicación, creatividad, capacidad de resolución de problemas, aprendizaje continuo y capacidad analítica.",
  "francoTestimonial": "Tuve la grata oportunidad de compartir proyecto grupal de graduación con Efraín. Durante el desarrollo del mismo tuve el placer de contar con su ayuda para la resolución de problemas y coordinación entre funcionalidades de la aplicación. Destaco su predisposición al aprendizaje de nuevas tecnologías y procesos, el dialogo y búsqueda de consenso que demostró, y la gran capacidad técnica y lógica que posee para realizar tareas exitosamente.",
  "franciscoTestimonial": "Conocí a Efraín cuando realizamos un proyecto grupal bastante grande y que debíamos entregar en una ventana de tiempo muy reducido, desde entonces seguimos trabajando juntos. Durante el tiempo de ese proyecto, Efra (como le decimos amistosamente) siempre se mantuvo de buen ánimo, especialmente en los momentos difíciles, siempre tenía algo para sumar en las reuniones, cuando los objetivos estaban cumplidos siempre nos proponía algo nuevo para hacer. No solo es un desarrollador con excelentes habilidades técnicas, sino que además es una persona con la que es muy agradable trabajar, especialmente para mí que me centro más en el back y Efra en el front, la comunicación siempre fue increíble, una paciencia enorme para ir debuggear el código y talento nato en su área de trabajo. ¡Lo recomiendo con los ojos cerrados!",
  "isaiasTestimonial": "Al momento de trabajar junto a Efrain, pude notar que posee muy buenas habilidades técnicas, al momento de resolver nuevas implementaciones se destacó por su pensamiento analítico, además cuando se enfrentaba a lo desconocido resaltó su proactividad y aprendizaje continuo, sin embargo, lo que más puedo destacar son sus soft skills de trabajo en equipo tales como la comunicación efectiva y asertiva."
}
