{
  "technologies": "Technologies",
  "projects": "Projects",
  "testimonials": "Testimonials",
  "aboutMeTitle": "About me",
  "aboutMe": "I am a someone who is passionate about programming and in constant personal and professional growth, whose main objective is to build a career in the IT world learning from my colleagues with a more extense trayectory and transmitting my knowledge to less experienced ones.",
  "downloadCV": "Download CV",
  "contactMe": "Contact me",
  "wineSupplyDescription": "We built a responsive (mobile-first approach) wine ecommerce app. My primary role was front end developer with typescript, react, redux, html and css. I was responsible for making the entire landing page, filter functionality, a checkout page with user's address (google maps API), login functionality, among other things.",
  "dogAppDescription": "The app consists of a full stack single page application (SAP) using the Dog API. For the backend I used express, to create endpoints to consume and post information that stores in a PostgreSQL database using Sequelize. For the frontend I used HTML5, CSS3, React.js and Redux to manage my requests to the backend.",
  "marvelAppDescription": "I used the marvel API to practice data fetching and its subsequent handling to manipulate the state of the application, at component level (useState) and at global level (Redux). On the page you can see characters that are related to their comics through a click, as well as add to favorites and filter through the search bar.",
  "copyRightNotice": "Intelectual property of Efraín Chacón Galindo",
  "contactInformation": "Contact information",
  "certificates": "Certificates",
  "social": "Social media",
  "previewMyCV": "Preview my CV",
  "previewMyCoverLetter": "Preview my cover letter",
  "needSomeone": "Need someone with this tech stack?",
  "seeMyProjects": "You could have this talent in your team",
  "colleaguesOpinion": "What my colleagues think of me",
  "eugeTestimonial": "I've worked with Efraín in a group project of 8 members, which was the final project to graduate as Full Stack Web Developer from Henry's Bootcamp. It's been a pleasure to share with him, very friendly, with good energy to start every day, a great colleague always willing to help and solve problems. He's made great contributions to the project from the front end, for which he had to learn new technologies, which he successfully implemented. He also added many ideas, well thought for the user interface, with very good style. I highlight his camaraderie, good communication, creativity, problem solving capacity, continuous learning and analytical capacity.",
  "francoTestimonial": "I had the great opportunity to share a graduation group project with Efraín. During its development, I had the pleasure of having his help in solving problems and coordinating between the application's functionalities. I highlight his willingness to learn new technologies and processes, the dialogue and search for consensus that he demonstrated, and the great technical and logical capacity that he possesses to carry out tasks successfully.",
  "franciscoTestimonial": "I met Efraín when we carried out a fairly large group project and that we had to deliver in a very short window of time, since then we've continued working together. During the time of this project, Efra (as we call him in a friendly way) always kept in good spirits, especially in difficult moments, he always had something to add to the meetings, when the objectives were met he always proposed something new to do. Not only is he a developer with excellent technical skills, but he is also a person who is very pleasant to work with, especially for me who focuses more on the back and Efra on the front, communication was always incredible, enormous patience for debugging the code and born talent in his area of work. I recommend him with my eyes closed!",
  "isaiasTestimonial": "At the time of working with Efrain, I was able to notice that he has very good technical skills, when solving new implementations he stood out for his analytical thinking, also when he faced the unknown he highlighted his proactivity and continuous learning, however, what I can highlight the most are his soft teamwork skills such as effective and assertive communication."
}
